robotics-masters/mm1-hat-arduino/custom_board/RoboHat-0.0.12/variants/robohat/variant.h
/*
  Copyright (c) 2014-2015 Arduino LLC.  All right reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
  See the GNU Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#ifndef _VARIANT_ITSYBITSY_ZERO_
#define _VARIANT_ITSYBITSY_ZERO_

// The definitions here needs a SAMD core >=1.6.10
#define ARDUINO_SAMD_VARIANT_COMPLIANCE 10610

/*----------------------------------------------------------------------------
 *        Definitions
 *----------------------------------------------------------------------------*/

/** Frequency of the board main oscillator */
#define VARIANT_MAINOSC		(32768ul)

/** Master clock frequency */
#define VARIANT_MCK			  (48000000ul)

/*----------------------------------------------------------------------------
 *        Headers
 *----------------------------------------------------------------------------*/

#include "WVariant.h"

#ifdef __cplusplus
#include "SERCOM.h"
#include "Uart.h"
#endif // __cplusplus

#ifdef __cplusplus
extern "C"
{
#endif // __cplusplus

/*----------------------------------------------------------------------------
 *        Pins
 *----------------------------------------------------------------------------*/

// Number of pins defined in PinDescription array
#define PINS_COUNT           (26u)
#define NUM_DIGITAL_PINS     (20u)
#define NUM_ANALOG_INPUTS    (12u)
#define NUM_ANALOG_OUTPUTS   (1u)
#define analogInputToDigitalPin(p)  ((p < 12u) ? (p) + PIN_A0 : -1)

#define digitalPinToPort(P)        ( &(PORT->Group[g_APinDescription[P].ulPort]) )
#define digitalPinToBitMask(P)     ( 1 << g_APinDescription[P].ulPin )
//#define analogInPinToBit(P)        ( )
#define portOutputRegister(port)   ( &(port->OUT.reg) )
#define portInputRegister(port)    ( &(port->IN.reg) )
#define portModeRegister(port)     ( &(port->DIR.reg) )
#define digitalPinHasPWM(P)        ( g_APinDescription[P].ulPWMChannel != NOT_ON_PWM || g_APinDescription[P].ulTCChannel != NOT_ON_TIMER )

/*
 * digitalPinToTimer(..) is AVR-specific and is not defined for SAMD
 * architecture. If you need to check if a pin supports PWM you must
 * use digitalPinHasPWM(..).
 *
 * https://github.com/arduino/Arduino/issues/1833
 */
// #define digitalPinToTimer(P)

// LEDs
#define PIN_LED_13           (13u)
#define PIN_LED              PIN_LED_13
#define LED_BUILTIN          PIN_LED_13


/* ROBO HAT MM1 pins */
#define ROBOHAT_SERVO_1      (2ul)
#define ROBOHAT_SERVO_2      (ROBOHAT_SERVO_1 + 1)
#define ROBOHAT_SERVO_3      (ROBOHAT_SERVO_2 + 1)
#define ROBOHAT_SERVO_4      (ROBOHAT_SERVO_3 + 1)
#define ROBOHAT_SERVO_5      (ROBOHAT_SERVO_4 + 1)
#define ROBOHAT_SERVO_6      (ROBOHAT_SERVO_5 + 1)
#define ROBOHAT_SERVO_7      (ROBOHAT_SERVO_6 + 1)
#define ROBOHAT_SERVO_8      (ROBOHAT_SERVO_7 + 1)

#define ROBOHAT_EXTERNAL_NEOPIXEL (10ul)

#define ROBOHAT_RCH_1      (PIN_A9)
#define ROBOHAT_RCH_2      (ROBOHAT_RCH_1 + 1)
#define ROBOHAT_RCH_3      (ROBOHAT_RCH_2 + 1)
#define ROBOHAT_RCH_4      (ROBOHAT_RCH_3 + 1)

#define ROBOHAT_SIGNAL_1     ()
#define ROBOHAT_SIGNAL_2     ()
#define ROBOHAT_SIGNAL_3     (11ul)
#define ROBOHAT_SIGNAL_4     (12ul)
#define ROBOHAT_SIGNAL_5     ()
#define ROBOHAT_SIGNAL_6     ()
#define ROBOHAT_SIGNAL_7     ()  // RX: serial 
#define ROBOHAT_SIGNAL_8     ()  // TX: serial
#define ROBOHAT_SIGNAL_9     ()
#define ROBOHAT_SIGNAL_10     ()
#define ROBOHAT_SIGNAL_11     ()

/* CRICKIT pins */
#define CRICKIT_DRIVE_1      (2ul)
#define CRICKIT_DRIVE_2      (CRICKIT_DRIVE_1 + 1)
#define CRICKIT_DRIVE_3      (CRICKIT_DRIVE_2 + 1)
#define CRICKIT_DRIVE_4      (CRICKIT_DRIVE_3 + 1)

#define CRICKIT_SERVO_1      (6ul)
#define CRICKIT_SERVO_2      (CRICKIT_SERVO_1 + 1)
#define CRICKIT_SERVO_3      (CRICKIT_SERVO_2 + 1)
#define CRICKIT_SERVO_4      (CRICKIT_SERVO_3 + 1)

#define CRICKIT_INTERNAL_NEOPIXEL (10ul)
#define CRICKIT_EXTERNAL_NEOPIXEL (11ul)

#define CRICKIT_IRQ          (12ul)

#define CRICKIT_TOUCH_1      (PIN_A9)
#define CRICKIT_TOUCH_2      (CRICKIT_TOUCH_1 + 1)
#define CRICKIT_TOUCH_3      (CRICKIT_TOUCH_2 + 1)
#define CRICKIT_TOUCH_4      (CRICKIT_TOUCH_3 + 1)

#define CRICKIT_VIN_SENSE    (PIN_A13)

#define CRICKIT_MOTOR_1A     (28ul)
#define CRICKIT_MOTOR_1B     (29ul)
#define CRICKIT_MOTOR_2A     (30ul)
#define CRICKIT_MOTOR_2B     (31ul)

/*
 * Analog pins
 */
#define PIN_A0               (14ul)
#define PIN_A1               (PIN_A0 + 1)
#define PIN_A2               (PIN_A0 + 2)
#define PIN_A3               (PIN_A0 + 3)
#define PIN_A4               (PIN_A0 + 4)
#define PIN_A5               (PIN_A0 + 5)
#define PIN_A6               (PIN_A0 + 6)
#define PIN_A7               (PIN_A0 + 7)
#define PIN_A8               (PIN_A0 + 8)
#define PIN_A9               (PIN_A0 + 9)
#define PIN_A10              (PIN_A0 + 10)
#define PIN_A11              (PIN_A0 + 11)
#define PIN_A12              (PIN_A0 + 12)
#define PIN_A13              (PIN_A0 + 13)
#define PIN_DAC0             (14ul)

static const uint8_t A0  = PIN_A0;
static const uint8_t A1  = PIN_A1;
static const uint8_t A2  = PIN_A2;
static const uint8_t A3  = PIN_A3;
static const uint8_t A4  = PIN_A4;
static const uint8_t A5  = PIN_A5;
static const uint8_t A6  = PIN_A6 ;
static const uint8_t A7  = PIN_A7 ;
static const uint8_t A8  = PIN_A8 ;
static const uint8_t A9  = PIN_A9 ;
static const uint8_t A10 = PIN_A10 ;
static const uint8_t A11 = PIN_A11 ;
static const uint8_t A12 = PIN_A12 ;
static const uint8_t A13 = PIN_A13 ;
static const uint8_t DAC0 = PIN_DAC0;

#define ADC_RESOLUTION		12

// Other pins
#define PIN_ATN              (38ul)
static const uint8_t ATN = PIN_ATN;

/*
 * Serial interfaces
 */

// Serial1
#define PIN_SERIAL1_TX       (35ul)
#define PIN_SERIAL1_RX       (36ul)
#define PAD_SERIAL1_TX       (UART_TX_PAD_2)
#define PAD_SERIAL1_RX       (SERCOM_RX_PAD_3)

/*
 * SPI Interfaces
 */
#define SPI_INTERFACES_COUNT 1


#define PIN_SPI1_MISO         (28u)
#define PIN_SPI1_MOSI         (29u)
#define PIN_SPI1_SCK          (30u)
#define PERIPH_SPI1           sercom2
#define PAD_SPI1_TX           SPI_PAD_0_SCK_1
#define PAD_SPI1_RX           SERCOM_RX_PAD_2

static const uint8_t SS1   = 31 ;	// HW SS isn't used. Set here only for reference.
static const uint8_t MOSI1 = PIN_SPI_MOSI ;
static const uint8_t MISO1 = PIN_SPI_MISO ;
static const uint8_t SCK1  = PIN_SPI_SCK ;

/*
 * Wire Interfaces
 */
#define WIRE_INTERFACES_COUNT 1

#define PIN_WIRE_SDA         (0u)
#define PIN_WIRE_SCL         (1u)
#define PERIPH_WIRE          sercom3
#define WIRE_IT_HANDLER      SERCOM3_Handler

static const uint8_t SDA = PIN_WIRE_SDA;
static const uint8_t SCL = PIN_WIRE_SCL;

/*
 * USB
 */
#define PIN_USB_HOST_ENABLE (32ul)
#define PIN_USB_DM          (33ul)
#define PIN_USB_DP          (34ul)
/*
 * I2S Interfaces
 */
#define I2S_INTERFACES_COUNT 1

#define I2S_DEVICE          0
#define I2S_CLOCK_GENERATOR 3
// PA07 ISD0
#define PIN_I2S_SD          (CRICKIT_TOUCH_4)
// PA10 I2SCK
#define PIN_I2S_SCK         (A6)
// PA11 IS2FS0
#define PIN_I2S_FS          (A4)       

#ifdef __cplusplus
}
#endif

/*----------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/

#ifdef __cplusplus

/*	=========================
 *	===== SERCOM DEFINITION
 *	=========================
*/
extern SERCOM sercom0;
extern SERCOM sercom1;
extern SERCOM sercom2;
extern SERCOM sercom3;
extern SERCOM sercom4;
extern SERCOM sercom5;

extern Uart Serial1;

#endif

// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
//
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
//
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
//
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
//
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
//
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                            pins are NOT connected to anything by default.
#define SERIAL_PORT_USBVIRTUAL      Serial
#define SERIAL_PORT_MONITOR         Serial
// Serial has no physical pins broken out, so it's not listed as HARDWARE port
#define SERIAL_PORT_HARDWARE        Serial1
#define SERIAL_PORT_HARDWARE_OPEN   Serial1

#endif /* _VARIANT_ARDUINO_ZERO_ */

